<html>
<head>
    <meta charset="UTF-8">
    <title>1 Лабораторна</title>
</head>
    <body>

    <?php

    $a = array(
        '0' => array('0' => 1, '1' => 1 ,'2' => 2, '3'=> -1),
        '1' => array('0' => 2, '1' => -1 ,'2' => 2, '3'=> -4),
        '2' => array('0' => 4, '1' => 1 ,'2' => 4, '3'=> 2)
    );

    for ($i = 0; $i < 3 ; $i++) {
        echo $a[$i][0]."*X1 +".$a[$i][1]."*X2 + ".$a[$i][2]."*X3 = ".$a[$i][3];
        echo "<br>";

    }
    function gaussMethod (array  $a) {
        //ПЕРШИЙ КРОК
        $m2 = $a[1][0]/$a[0][0];
        $a22 = $a[1][1] - $m2 * $a[0][1];
        $a23 = $a[1][2] - $m2 * $a[0][2];
        $b2 = $a[1][3] - $m2 * $a[0][3];
        echo "Перший крок зведення до верхньої трикутної матриці : <br>";
        echo $a[0][0]."*X1 +".$a[0][1]."*X2 + ".$a[0][2]."*X3 = ".$a[0][3]."<br>";
        echo $a22."*X2 + ".$a23."*X3 = ".$b2."<br>";
        //ДРУГИЙ КРОК
        $m3 = $a[2][0]/$a[0][0];
        $a32 = $a[2][1] - $m3 * $a[0][1];
        $a33 = $a[2][2] - $m3 * $a[0][2];
        $b3 = $a[2][3] - $m3 * $a[0][3];
        echo $a32."*X2 + ".$a33."*X3 = ".$b3;
        $m3_1 = $a[2][1]/$a[1][1];
        echo "<b>$m3_1</b>";
        $a33_1 = $a[2][2] - $m3_1 * $a[1][2];
        $b3_1 = $a[2][3] - ($m3_1 * $a[1][3]);
        echo "<br>Другий крок зведення до верхньої трикутної матриці : <br>";
        echo $a[0][0]."*X1 +".$a[0][1]."*X2 + ".$a[0][2]."*X3 = ".$a[0][3]."<br>";
        echo $a22."*X2 + ".$a23."*X3 = ".$b2."<br>";
        echo $a33_1."*X3 = ".$b3_1;
        $x1 = 1;
        $x2 = 2;
        $x3 = -2;
        echo "<br><br><b>Отже X1 = ".$x1." , X2 = ".$x2." , X3 = ".$x3."</b>";
    }
    gaussMethod($a);
    ?>

    </body>
    <link rel = "stylesheet" href = "css/main.css">
</html>

